tap "nikitabobko/tap" # Aerospace
tap "jorgerojas26/lazysql" 

# CLI Tools
brew "git"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "btop"
brew "lazygit"
brew "lazysql"
brew "awscli"
brew "jq"
brew "yq"
brew "gh"
brew "delta"
brew "tmux"
brew "stow"
brew "neovim"
brew "starship"

# Languages n stuff
brew "python"
brew "pipx"
brew "node"
brew "nvm"

# GNU Utilities
brew "coreutils"
brew "gnu-sed"
brew "findutils"
brew "gawk"

# GUI Applications
cask "cursor"
cask "raycast"
cask "docker"
cask "ghostty"
cask "aerospace"
cask "caffeine"
cask "chatgpt"
cask "shottr"
cask "caffeine" 
# cash "zoom" - I don't want to install this by default

# Fonts
cask "font-jetbrains-mono-nerd-font"

